#language: ru
Функционал: Поиск товаров


  Сценарий: Поиск телевизоров

    Когда нажата кнопка Маркет
    И переход на вкладку "2"
    И выбран раздел Электроника
    И выбран раздел "Телевизоры и аксессуары"
    И выбран раздел "Телевизоры"
    И нажата кнопка Все фильтры

    И указана минимальная цена "20000"
    И нажата кнопка Показать еще в разделе Производитель
    И выбран производитель "Samsung"
    И выбран производитель "LG"
    И нажата кнопка Показать предложения

    Тогда количество элементов на доске "48"
    Тогда первый элемент совпадает с поиском