#language: ru
Функционал: Поиск товаров


  Сценарий: Поиск наушников

  Когда нажата кнопка Маркет
  И переход на вкладку "2"
  И выбран раздел на главной странице "Электроника"
  И выбран раздел "Наушники, Bluetooth-гарнитуры, аксессуары"
  И выбран раздел "Наушники и Bluetooth-гарнитуры"
  И нажата кнопка Все фильтры

  И указана минимальная цена "5000"
  И нажата кнопка Показать еще в разделе Производитель
  И выбран производитель "Beats"
  И нажата кнопка Показать предложения

  Тогда количество элементов на доске "17"
  Тогда первый элемент совпадает с поиском